jcfain/TCodeESP32/ESP32/src/main.cpp
}
void logCallBack(const char* in, LogLevel level) {
#if WIFI_TCODE
	// if(webSocketHandler) {
	// 	webSocketHandler->sendDebug(in, level);
	// }
#endif
}
#if BUILD_TEMP
	void tempChangeCallBack(TemperatureType type, const char* message, float temp) {
	#if WIFI_TCODE
		if(webSocketHandler) {
			if (strpbrk(message, "{") == nullptr) {
				webSocketHandler->sendCommand(message);
			} else {
				if(type == TemperatureType::SLEEVE) {
					webSocketHandler->sendCommand("sleeveTempStatus", message);
				} else {
					webSocketHandler->sendCommand("internalTempStatus", message);
				}
			}
		}
	#endif
	#if BUILD_DISPLAY
		if(displayHandler) {
			if(type == TemperatureType::SLEEVE) {
				displayHandler->setSleeveTemp(temp);
			} else {
				displayHandler->setInternalTemp(temp);
			}
		}
	#endif
	}
	void tempStateChangeCallBack(TemperatureType type, const char* state) {
	#if BUILD_DISPLAY
		if(displayHandler) {
			if(type == TemperatureType::SLEEVE) {
				LogHandler::verbose(TagHandler::Main, "tempStateChangeCallBack heat: %s", state);
				displayHandler->setHeateState(state);
				if(temperatureHandler)
					displayHandler->setHeateStateShort(temperatureHandler->getShortSleeveControlStatus(state));
			} else {
				LogHandler::verbose(TagHandler::Main, "tempStateChangeCallBack fan: %s", state);
				displayHandler->setFanState(state);
			}
		}
	#endif
	}
#endif
#if WIFI_TCODE
void startWeb(const bool &apMode, const int &port, const int &udpPort, const char* hostname, const char* friendlyName) {
	if(!webHandler) {
		displayPrint("Starting web server");
		#if !SECURE_WEB
			webHandler = new WebHandler();
			webSocketHandler = new WebSocketHandler();
		#else
			webHandler = new HTTPSHandler();
			webSocketHandler = new SecureWebSocketHandler();
		#endif
		webHandler->setup(port, webSocketHandler, apMode);
		if(!apMode)
			mdnsHandler.setup(hostname, friendlyName, port, udpPort);
		
		#if SECURE_WEB
			LogHandler::debug(TagHandler::Main, "Start https task");
			auto httpsStatus = xTaskCreateUniversal(
				HTTPSHandler::startLoop,/* Function to implement the task */
				"HTTPSTask", /* Name of the task */
				8192 * 3,  /* Stack size in words */
				webHandler,  /* Task input parameter */
				3,  /* Priority of the task */
				&httpsTask,  /* Task handle. */
				-1); /* Core where the task should run */
			if(httpsStatus != pdPASS) {
				LogHandler::error(TagHandler::Main, "Could not start https task.");
			}
		#endif
	}
}
#endif

void startBLEConfig() {
	// if(!bleConfigurationHandler) {
	// 	displayPrint("Starting BLE config");
	// 	bleConfigurationHandler = new BLEConfigurationHandler();
	// 	bleConfigurationHandler->setup();
	// }
}

#if BLE_TCODE
void startBLE() {
	if(!bleHandler) {
		displayPrint("Starting BLE");
		bleHandler = new BLEHandler();
		bleHandler->setup();
	}
}
#endif

#if BLUETOOTH_TCODE
void startBlueTooth() {
	if(!btHandler) {
		displayPrint("Starting Bluetooth serial");
		btHandler = new BluetoothHandler();
		btHandler->setup();
	}
}
#endif

#if WIFI_TCODE
void startUDP(int port) {
	if(!udpHandler) {
		displayPrint("Starting UDP");
		udpHandler = new Udphandler();
		udpHandler->setup(port);
	}
}
#endif

#if WIFI_TCODE
void startConfigMode(const int &webPort, const int &udpPort, const char* hostname, const char* friendlyName) {
	SettingsHandler::apMode = true;
	LogHandler::info(TagHandler::Main, "Starting in APMode");
	displayPrint("Starting in APMode");
	if (wifi.startAp()) 
	{
		LogHandler::info(TagHandler::Main, "APMode started");
		displayPrint("APMode started");
		startWeb(SettingsHandler::apMode, webPort, udpPort, hostname, friendlyName);
	}
	else 
	{
		LogHandler::error(TagHandler::Main, "APMode start failed");
		displayPrint("APMode start failed");
	}

// // After attempting to connect wifi, ble cause crash
// 	if(withBle) { 
// 		startBLEConfig();
// 	}
}
#endif

#if WIFI_TCODE
void wifiStatusCallBack(WiFiStatus status, WiFiReason reason) {
	if(status == WiFiStatus::CONNECTED) {
        LogHandler::debug(TagHandler::Main, "wifiStatusCallBack WiFiStatus::CONNECTED");
		if(reason == WiFiReason::AP_MODE) {
        	LogHandler::debug(TagHandler::Main, "wifiStatusCallBack WiFiReason::AP_MODE");
            // if(bleConfigurationHandler)
            //   bleConfigurationHandler->stop(); // If a client connects to the ap stop the BLE to save memory.
		}
	} else {
		// wifi.dispose();
		// startApMode();
        LogHandler::debug(TagHandler::Main, "wifiStatusCallBack Not connected");
		if(reason == WiFiReason::NO_AP || reason == WiFiReason::UNKNOWN) {
        	LogHandler::debug(TagHandler::Main, "wifiStatusCallBack WiFiReason::NO_AP || WiFiReason::UNKNOWN");
			startConfigMode(
				SettingsHandler::getWebServerPort(), 
				SettingsHandler::getUdpServerPort(),
				SettingsHandler::getHostname(),
				SettingsHandler::getFriendlyName());
		} else if(reason == WiFiReason::AUTH) {
        	LogHandler::debug(TagHandler::Main, "wifiStatusCallBack WiFiReason::AUTH");
            LogHandler::warning(TagHandler::Main, "Connection auth failed: Resetting wifi password and restarting");
            SettingsHandler::defaultValue(WIFI_PASS_SETTING);
            ESP.restart();
		}  else if(reason == WiFiReason::AP_MODE) {
        	LogHandler::debug(TagHandler::Main, "wifiStatusCallBack WiFiReason::AP_MODE");
			// #if !ESP32_DA
			// if(bleConfigurationHandler)
			// 	bleConfigurationHandler->setup();
			// #endif
		}
	}
}
#endif

void batteryVoltageCallback(float capacityRemainingPercentage, float capacityRemaining, float voltage, float temperature) {
	#if BUILD_DISPLAY
		if(displayHandler) {
			displayHandler->setBatteryInformation(capacityRemainingPercentage, voltage, temperature);
		}
	#endif
	#if WIFI_TCODE
		if(webSocketHandler) {
			String statusJson("{\"batteryCapacityRemaining\":\"" + String(capacityRemaining) + "\", \"batteryCapacityRemainingPercentage\":\"" + String(capacityRemainingPercentage) + "\", \"batteryVoltage\":\""+String(voltage)+"\", \"batteryTemperature\":\""+String(temperature)+"\"}");
			webSocketHandler->sendCommand("batteryStatus", statusJson.c_str());
		}
	#endif
}

