jcfain/TCodeESP32/ESP32/src/main.cpp
void settingChangeCallback(const char* group, const char* settingThatChanged) {
    LogHandler::debug(TagHandler::Main, "settingChangeCallback: %s", settingThatChanged);
	if(strcmp(group, "motionGenerator") == 0) {
		if(strcmp(settingThatChanged, "motionSelectedProfileIndex") == 0 || strcmp(settingThatChanged, "motionProfile") == 0) 
			motionHandler.setMotionChannels(SettingsHandler::getMotionChannels());
		// else if(strcmp(settingThatChanged, "motionChannels") == 0) 
		// 	motionHandler.setMotionChannels(SettingsHandler::getGetMotionChannels()());
		else if(strcmp(settingThatChanged, "motionEnabled") == 0) 
			motionHandler.setEnabled(SettingsHandler::getMotionEnabled());
		// else if(strcmp(settingThatChanged, "motionAmplitudeGlobal") == 0) 
		// 	motionHandler.setAmplitude(SettingsHandler::getGetMotionAmplitudeGlobal()());
		// else if(strcmp(settingThatChanged, "motionOffsetGlobal") == 0) 
		// 	motionHandler.setOffset(SettingsHandler::getGetMotionOffsetGlobal()());
		// else if(strcmp(settingThatChanged, "motionPeriodGlobal") == 0) 
		// 	motionHandler.setPeriod(SettingsHandler::getGetMotionPeriodGlobal()());
		// else if(strcmp(settingThatChanged, "motionUpdateGlobal") == 0) 
		// 	motionHandler.setUpdate(SettingsHandler::getGetMotionUpdateGlobal()());
		// else if(strcmp(settingThatChanged, "motionPhaseGlobal") == 0) 
		// 	motionHandler.setPhase(SettingsHandler::getGetMotionPhaseGlobal()());
		// else if(strcmp(settingThatChanged, "motionReversedGlobal") == 0) 
		// 	motionHandler.setReverse(SettingsHandler::getGetMotionReversedGlobal()());
		// else if(strcmp(settingThatChanged, "motionAmplitudeGlobalRandom") == 0) 
		// 	motionHandler.setAmplitudeRandom(SettingsHandler::getGetMotionAmplitudeGlobalRandom()());
		// else if(strcmp(settingThatChanged, "motionAmplitudeGlobalRandomMin") == 0) 
		// 	motionHandler.setAmplitudeRandomMin(SettingsHandler::getGetMotionAmplitudeGlobalRandomMin()());
		// else if(strcmp(settingThatChanged, "motionAmplitudeGlobalRandomMax") == 0) 
		// 	motionHandler.setAmplitudeRandomMax(SettingsHandler::getGetMotionAmplitudeGlobalRandomMax()());
		// else if(strcmp(settingThatChanged, "motionPeriodGlobalRandom") == 0) 
		// 	motionHandler.setPeriodRandom(SettingsHandler::getGetMotionPeriodGlobalRandom()());
		// else if(strcmp(settingThatChanged, "motionPeriodGlobalRandomMin") == 0) 
		// 	motionHandler.setPeriodRandomMin(SettingsHandler::getGetMotionPeriodGlobalRandomMin()());
		// else if(strcmp(settingThatChanged, "motionPeriodGlobalRandomMax") == 0) 
		// 	motionHandler.setPeriodRandomMax(SettingsHandler::getGetMotionPeriodGlobalRandomMax()());
		// else if(strcmp(settingThatChanged, "motionOffsetGlobalRandom") == 0) 
		// 	motionHandler.setOffsetRandom(SettingsHandler::getGetMotionOffsetGlobalRandom()());
		// else if(strcmp(settingThatChanged, "motionOffsetGlobalRandomMin") == 0) 
		// 	motionHandler.setOffsetRandomMin(SettingsHandler::getGetMotionOffsetGlobalRandomMin()());
		// else if(strcmp(settingThatChanged, "motionOffsetGlobalRandomMax") == 0) 
		// 	motionHandler.setOffsetRandomMax(SettingsHandler::getGetMotionOffsetGlobalRandomMax()());
		// else if(strcmp(settingThatChanged, "motionRandomChangeMin") == 0) 
		// 	motionHandler.setMotionRandomChangeMin(SettingsHandler::getGetMotionRandomChangeMin()());
		// else if(strcmp(settingThatChanged, "motionRandomChangeMax") == 0) 
		// 	motionHandler.setMotionRandomChangeMax(SettingsHandler::getGetMotionRandomChangeMax()());
	} else if(voiceHandler && strcmp(group, "voiceHandler") == 0) {
		if(strcmp(settingThatChanged, "voiceMuted") == 0) 
			voiceHandler->setMuteMode(SettingsHandler::getVoiceMuted());
		else if(strcmp(settingThatChanged, "voiceVolume") == 0) 
			voiceHandler->setVolume(SettingsHandler::getVoiceVolume());
		else if(strcmp(settingThatChanged, "voiceWakeTime") == 0) 
			voiceHandler->setWakeTime(SettingsHandler::getVoiceWakeTime());
	} else if(buttonHandler && strcmp(group, "buttonCommand") == 0) {
		if(strcmp(settingThatChanged, "bootButtonCommand") == 0) 
			buttonHandler->updateBootButtonCommand(SettingsHandler::getBootButtonCommand());
		else if(strcmp(settingThatChanged, "analogButtonCommands") == 0) {
			buttonHandler->updateAnalogButtonCommands(SettingsHandler::getButtonSets());
		} else if(strcmp(settingThatChanged, "buttonAnalogDebounce") == 0) {
			buttonHandler->updateAnalogDebounce(SettingsHandler::getButtonAnalogDebounce());
		}
	} else if(strcmp(group, "channelRanges") == 0) {// TODO add channe; specific updates when moving to its own save...maybe...
		motionHandler.updateChannelRanges();
	}
	
	
}
void loadI2CModules(bool displayEnabled, bool batteryEnabled, bool voiceEnabled) {
#if BUILD_DISPLAY
	if(displayEnabled)
	{
    	LogHandler::debug(TagHandler::Main, "Start Display task");
		auto displayStatus = xTaskCreatePinnedToCore(
			DisplayHandler::startLoop,/* Function to implement the task */
			"DisplayTask", /* Name of the task */
			5000,  /* Stack size in words */
			displayHandler,  /* Task input parameter */
			1,  /* Priority of the task */
			&displayTask,  /* Task handle. */
			APP_CPU_NUM); /* Core where the task should run */
			if(displayStatus != pdPASS) {
    			LogHandler::error(TagHandler::Main, "Could not start display task.");
			}
	}
#endif
	if(batteryEnabled) {
		batteryHandler = new BatteryHandler();
		if(batteryHandler->setup()) {
			LogHandler::debug(TagHandler::Main, "Start Battery task");
			auto batteryStatus = xTaskCreatePinnedToCore(
				BatteryHandler::startLoop,/* Function to implement the task */
				"BatteryTask", /* Name of the task */
				4028,  /* Stack size in words */
				batteryHandler,  /* Task input parameter */
				1,  /* Priority of the task */
				&batteryTask,  /* Task handle. */
				APP_CPU_NUM); /* Core where the task should run */
				if(batteryStatus != pdPASS) {
					LogHandler::error(TagHandler::Main, "Could not start battery task.");
				}
				batteryHandler->setMessageCallback(batteryVoltageCallback);
		}
	}
	if(voiceEnabled) {
		voiceHandler = new VoiceHandler();
		voiceHandler->setMessageCallback(TCodeCommandCallback);
		if(voiceHandler->setup()) {
			LogHandler::debug(TagHandler::Main, "Start Voice task");
			auto voiceStatus = xTaskCreatePinnedToCore(
				VoiceHandler::startLoop,/* Function to implement the task */
				"VoiceTask", /* Name of the task */
				4028,  /* Stack size in words */
				voiceHandler,  /* Task input parameter */
				1,  /* Priority of the task */
				&voiceTask,  /* Task handle. */
				APP_CPU_NUM); /* Core where the task should run */
				if(voiceStatus != pdPASS) {
					LogHandler::error(TagHandler::Main, "Could not start voice task.");
				}
		}
	}
}
void setup() 
{
	// see if we can use the onboard led for status
	//https://github.com/kriswiner/ESP32/blob/master/PWM/ledcWrite_demo_ESP32.ino
  	//digitalWrite(5, LOW);// Turn off on-board blue led

	


