jcfain/TCodeESP32/ESP32/src/main.cpp
	Serial.begin(115200);
	
    LogHandler::setLogLevel(LogLevel::INFO);
	LogHandler::setMessageCallback(logCallBack);
	#if WIFI_TCODE
		wifi.setWiFiStatusCallback(wifiStatusCallBack);
	#endif

	Serial.println();
 	LogHandler::info(TagHandler::Main, "TCode esp version: %s", FIRMWARE_VERSION_NAME);
 	//LogHandler::info(TagHandler::Main, "Esp arduino version: %s", ESP_ARDUINO_VERSION_STR);
 	LogHandler::info(TagHandler::Main, "ESP IDF version: %s", esp_get_idf_version());
	uint32_t chipId = 0;
	for(int i=0; i<17; i=i+8) {
	  chipId |= ((ESP.getEfuseMac() >> (40 - i)) & 0xff) << i;
	}
	LogHandler::info(TagHandler::Main, "ESP32 Chip model = %s Rev %d", ESP.getChipModel(), ESP.getChipRevision());
	LogHandler::info(TagHandler::Main, "This chip has %d cores", ESP.getChipCores());
 	LogHandler::info(TagHandler::Main, "Chip ID: %u", chipId);
	Serial.println();
	

    // esp_log_level_set("*", ESP_LOG_VERBOSE);
	// LogHandler::debug("main", "this is verbose");
	// LogHandler::debug("main", "this is debug");
	// LogHandler::info("main", "this is info");
	// LogHandler::warning("main", "this is warning");
	// LogHandler::error("main", "this is error");

	if(!LittleFS.begin(true))
	{
		LogHandler::error(TagHandler::Main, "An Error has occurred while mounting LittleFS");
		setupSucceeded = false;
		return;
	}

	SettingsHandler::init();
	LogHandler::info(TagHandler::Main, "Version: %s", FIRMWARE_VERSION_NAME);
	
	// GEt ConfigurationSettings
	int Display_Rst_PIN = DISPLAY_RST_PIN_DEFAULT;
	SettingsHandler::getValue(DISPLAY_RST_PIN, Display_Rst_PIN);
	bool fanControlEnabled = FAN_CONTROL_ENABLED_DEFAULT;
	SettingsHandler::getValue(FAN_CONTROL_ENABLED, fanControlEnabled);

    // Cached (Requires reboot)
    MotorType motorType;
    BoardType boardType;
	SettingsHandler::getValue(MOTOR_TYPE_SETTING, motorType);
	SettingsHandler::getValue(BOARD_TYPE_SETTING, boardType);

#if WIFI_TCODE
    char ssid[SSID_LEN];
    char wifiPass[WIFI_PASS_LEN];
    bool staticIP;
    char localIP[IP_ADDRESS_LEN];
    char gateway[IP_ADDRESS_LEN];
    char subnet[IP_ADDRESS_LEN];
    char dns1[IP_ADDRESS_LEN];
    char dns2[IP_ADDRESS_LEN];

	SettingsHandler::getValue(SSID_SETTING, ssid, SSID_LEN);
	SettingsHandler::getValue(WIFI_PASS_SETTING, wifiPass, WIFI_PASS_LEN);
	SettingsHandler::getValue(STATICIP, staticIP);
	SettingsHandler::getValue(LOCALIP, localIP, IP_ADDRESS_LEN);
	SettingsHandler::getValue(GATEWAY, gateway, IP_ADDRESS_LEN);
	SettingsHandler::getValue(SUBNET, subnet, IP_ADDRESS_LEN);
	SettingsHandler::getValue(DNS1, dns1, IP_ADDRESS_LEN);
	SettingsHandler::getValue(DNS2, dns2, IP_ADDRESS_LEN);

#endif

    int msPerRad;
    int servoFrequency;
    int pitchFrequency;
    int valveFrequency;
    int twistFrequency;
    int squeezeFrequency;
    bool lubeEnabled;
    bool feedbackTwist;
    bool analogTwist;
    bool bootButtonEnabled;
    bool buttonSetsEnabled;
#if MOTOR_TYPE == 0

#elif MOTOR_TYPE == 1
    bool BLDC_UseHallSensor;

    #warning validate
    double BLDC_MotorA_Voltage;
    double BLDC_MotorA_Current;
    bool BLDC_MotorA_ParametersKnown;
    double BLDC_MotorA_ZeroElecAngle;
    int BLDC_Pulley_Circumference;
    int BLDC_StrokeLength;
    int BLDC_RailLength;
    bool BLDC_UseMT6701;

	SettingsHandler::getValue(BLDC_MOTORA_VOLTAGE, BLDC_MotorA_Voltage);
	SettingsHandler::getValue(BLDC_MOTORA_CURRENT, BLDC_MotorA_Current);
	SettingsHandler::getValue(BLDC_MOTORA_PARAMETERSKNOWN, BLDC_MotorA_ParametersKnown);
	SettingsHandler::getValue(BLDC_MOTORA_ZEROELECANGLE, BLDC_MotorA_ZeroElecAngle);
	SettingsHandler::getValue(BLDC_PULLEY_CIRCUMFERENCE, BLDC_Pulley_Circumference);
	SettingsHandler::getValue(BLDC_STROKELENGTH, BLDC_StrokeLength);
	SettingsHandler::getValue(BLDC_RAILLENGTH, BLDC_RailLength);
	SettingsHandler::getValue(BLDC_USEMT6701, BLDC_UseMT6701);
#endif

#if BUILD_TEMP
    bool sleeveTempEnabled;
    bool internalTempEnabled;
    int heaterFrequency;
    int heaterResolution;
	float heaterThreshold;
    int caseFanFrequency;
    int caseFanResolution;
	SettingsHandler::getValue(TEMP_SLEEVE_ENABLED, sleeveTempEnabled);
	SettingsHandler::getValue(TEMP_INTERNAL_ENABLED, internalTempEnabled);
	SettingsHandler::getValue(HEATER_FREQUENCY, heaterFrequency);
	SettingsHandler::getValue(HEATER_RESOLUTION, heaterResolution);
	SettingsHandler::getValue(HEATER_THRESHOLD, heaterThreshold);
	SettingsHandler::getValue(CASE_FAN_FREQUENCY, caseFanFrequency);
	SettingsHandler::getValue(CASE_FAN_RESOLUTION, caseFanResolution);
	
#endif

	SettingsHandler::getValue(MS_PER_RAD, msPerRad);
	SettingsHandler::getValue(SERVO_FREQUENCY, servoFrequency);
	SettingsHandler::getValue(PITCH_FREQUENCY, pitchFrequency);
	SettingsHandler::getValue(VALVE_FREQUENCY, valveFrequency);
	SettingsHandler::getValue(TWIST_FREQUENCY, twistFrequency);
	SettingsHandler::getValue(SQUEEZE_FREQUENCY, squeezeFrequency);
	SettingsHandler::getValue(FEEDBACK_TWIST, feedbackTwist);
	SettingsHandler::getValue(ANALOG_TWIST, analogTwist);
	SettingsHandler::getValue(BOOT_BUTTON_ENABLED, bootButtonEnabled);
	SettingsHandler::getValue(BUTTON_SETS_ENABLED, buttonSetsEnabled);

    bool batteryLevelEnabled;
    bool voiceEnabled;
	SettingsHandler::getValue(BATTERY_LEVEL_ENABLED, batteryLevelEnabled);
	SettingsHandler::getValue(VOICE_ENABLED, voiceEnabled);

    bool displayEnabled;
	SettingsHandler::getValue(DISPLAY_ENABLED, displayEnabled);
	char Display_I2C_AddressString[DISPLAY_I2C_ADDRESS_LEN] = {0};
	SettingsHandler::getValue(DISPLAY_I2C_ADDRESS, Display_I2C_AddressString, DISPLAY_I2C_ADDRESS_LEN);
	int Display_I2C_Address = (int)strtol(Display_I2C_AddressString, NULL, 0);

	systemCommandHandler = new SystemCommandHandler();
	systemCommandHandler->registerExternalCommandCallback(TCodePassthroughCommandCallback);

#if MOTOR_TYPE == 0
	if(SettingsHandler::getTCodeVersionEnum() == TCodeVersion::v0_3) {
		motorHandler = new ServoHandler0_3();
	}
	#if !DEBUG_BUILD && TCODE_V2
		else if(SettingsHandler::getTCodeVersionEnum() == TCodeVersion::v0_2)
			motorHandler = new ServoHandler0_2();
	#endif
		else {
			LogHandler::error(TagHandler::Main, "Invalid TCode version: %ld", SettingsHandler::getTCodeVersionEnum());
			return;// TODO: this stops apmode and not what we want
			//motorHandler = new ServoHandler1_0();
		}
#elif MOTOR_TYPE == 1
	motorHandler = new BLDCHandler0_3();
#else
	LogHandler::error(TagHandler::Main, "Invalid motor type defined!");
	return;
#endif

	motorHandler->setMessageCallback(TCodeCommandCallback);
	//SystemCommandHandler::registerOtherCommandCallback(TCodeCommandCallback);

